import React from 'react';
import classes from "../RigthBar.module.css";

const LengRU = () => {
    return (
        <div>
            <p className={'tytle' + ' ' + classes.RTytle}>Профиль</p>

            <p>
                Front-end разработчик с опытом работы более 4 лет, в том числе более 3 лет коммерческой разработки.
            </p>
            <p>
                Я разрабатываю масштабируемые и поддерживаемые веб-приложения с использованием таких технологий, как React, Next.js, Redux и JWT Authentication. У меня есть опыт разработки и разработки веб-приложений с нуля.
            </p>
            <p>
                Я работал удаленным разработчиком и фрилансером. Так что у меня высокий уровень самоуправления и отзывчивости.
            </p>
            <p>
                В начале своей карьеры я работал над двумя проектами электронной коммерции на CMS Opencart, каждый из которых посещали более 300 000 человек в месяц.
            </p>
            <p>
                Technology Stack: JavaScript, React, Redux, REST API, next.js, express.js, MongoDB, Node.js HTML, CSS, SCSS, BEM, Ajax, Responsive markup, Adobe Photoshop, Figma, jQuery, PHP, Git, MySQL, Gulp
            </p>
            <p>
                Также у меня есть навыки по разработке кросс-браузерной, валидной и адаптивной верстки. Компоновка в соответствии с валидатором w3. Я эффективно использую Photoshop, Figma, для дизайна. Знание основ ООП на JS и PHP.
            </p>
            <p>
                У меня есть четкое понимание подхода mobile-first approach in markup, знаком с методологией БEM. Полное знание DOM (поиск, манипулирование), js Events.
            </p>


            <p className={'tytle'}>
                Трудовой опыт
            </p>
            <p>
                C Апрелья 2020 г.
            </p>
            <p>
                <b> Frontend Developer на проекте Tattz для мастеров и студий татуировок.</b>
            </p>
            <p> Разработка фронт-энда с нуля Market Place / системы бронирования для тату-салонов и специалистов.</p>
            <ul>
                <li> Проект включает в себя:</li>
                <li>  - Специалист и Студия галерея и поиск</li>
                <li>  - Личные профили для мастеров и студий</li>
                <li>  - Система бронирования</li>
                <li>  - Авторизация и регистрация с использованием JWT</li>
                <li>  - Различные интеграции API Карт Google</li>
                <li> - Интеграция Backend API</li>
            </ul>
            <p>  Я был единственным разработчиком внешнего интерфейса, поэтому я полностью отвечал за разработку проекта.</p>

            <p> Я разработал проект с использованием таких технологий, как: React, Next.js, Redux, React Hook Forms, API Карт Google.</p>
            <p>
                <b> Frontend Developer на e-commerce проектах, Tesla Weld, Tatra Garden </b>
            </p>
            <p>
                Jun 2018 – Aug 2019
            </p>
            <p>
                Занимался разработкой landing pages для запуска рекламных компаний, разработкой страниц для основных
                сайтов на основе CMS Opencart. Разрабатываю элементы анимированного интерфейса и интерактивных частей
                страницы (Опросники, подборщики, квизы, анимации...) Оптимизация сайта под Google PageSpeed Insight,
                исправлене ошибок w3 валидатора.
            </p>
        </div>
    )
};

export default LengRU